In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("category_splitsing.csv", sep=",")
df.head()

               category  count_2024  count_2025
0    Harvard University       23795       39556
1   Stanford University       38752       24037
2                   MIT       39842       15549
3       Yale University       34055       21909
4  Princeton University       37885       35190

In [ ]:
def remove_university_suffix(category: str)-> str:
    university = category.replace('University', "").strip()
    return university
    
    
    # if "(B/T)" in category:
    #     return "B/T"
    # elif "(SOC)" in category:
    #     return "SOC"
    

remove_university_suffix("Harvard University")

'Harvard'

In [7]:
df["university"] = df["category"].apply(remove_university_suffix)
df.head()

               category  count_2024  count_2025 university
0    Harvard University       23795       39556    Harvard
1   Stanford University       38752       24037   Stanford
2                   MIT       39842       15549        MIT
3       Yale University       34055       21909       Yale
4  Princeton University       37885       35190  Princeton

In [14]:
def average(two_columns)-> float:
    average = sum(two_columns) / 2
    return average

In [15]:
df["average_count"] = df[["count_2024", "count_2025"]].apply(average, axis=1)
df.head()

               category  count_2024  count_2025 university  average_count
0    Harvard University       23795       39556    Harvard        31675.5
1   Stanford University       38752       24037   Stanford        31394.5
2                   MIT       39842       15549        MIT        27695.5
3       Yale University       34055       21909       Yale        27982.0
4  Princeton University       37885       35190  Princeton        36537.5

# LOOPS